snlkuharlocal/src/Documents/ЗаказНаЭмиссиюКодовМаркировкиСУЗ/ЗаказНаЭмиссиюКодовМаркировкиСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаказНаЭмиссиюКодовМаркировкиСУЗ</name>
  <comment>Заказ на эмиссию кодов маркировки СУЗ</comment>
  <basedOn>Document.ЗаказПоставщику</basedOn>
  <basedOn>Document.РасходнаяНакладная</basedOn>
  <basedOn>Document.ПриходнаяНакладная</basedOn>
  <registerRecords>InformationRegister.СтатусыКМ_Факт</registerRecords>
  <registerRecords>InformationRegister.СтатусыКМ_ЧЗ</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиДоступныхКМ</registerRecords>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппыТоваров</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыДокументовМаркировки</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособВводаВОборот</name>
    <type>
      <types>EnumRef.СпособыВводаВОборотСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.Комплектация</types>
      <types>DocumentRef.ЗаказНаЭмиссиюКодовМаркировкиСУЗ</types>
      <types>DocumentRef.КонтрактСПроизводителем</types>
      <types>DocumentRef.ПриходнаяНакладная</types>
      <types>DocumentRef.ЗаказПоставщику</types>
      <types>DocumentRef.Инвентаризация</types>
      <types>DocumentRef.РасходнаяНакладная</types>
      <types>DocumentRef.Перемаркировка</types>
    </type>
  </attributes>
  <attributes>
    <name>ИД_ДокументаЧЗ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПолученоКодов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПолученоКодовИзЧЗ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекстОшибки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Закрыт</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидНоменклатурыЧЗВДокументе</name>
    <type>
      <types>EnumRef.ВидыНоменклатурыЧЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеНанесения</name>
    <type>
      <types>CatalogRef.Подразделения</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусВводаВОборот</name>
    <type>
      <types>EnumRef.СтатусыДокументовМаркировки</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбработкаЗапланирована</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидКомплекта</name>
    <type>
      <types>EnumRef.ВидыКомплектов</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоКомплект</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПолученоКодовКомплект</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СозданАвтоматически</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ГТИН</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>14</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоКомплект</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДокументыОснования</name>
    <attributes>
      <name>ДокументОснование</name>
      <type>
        <types>DocumentRef.Комплектация</types>
        <types>DocumentRef.РасходнаяНакладная</types>
        <types>DocumentRef.Перемещение</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/InformationRegisters/СтатусыКМ_ЧЗ/СтатусыКМ_ЧЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтатусыКМ_ЧЗ</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыКодовМаркировкиИСМП</types>
    </type>
  </resources>
  <dimensions>
    <name>ШтрихКодУпаковки</name>
    <type>
      <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/InformationRegisters/СтатусыКМ_Факт/СтатусыКМ_Факт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтатусыКМ_Факт</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыКодовМаркировкиФакт</types>
    </type>
  </resources>
  <resources>
    <name>Местонахождение</name>
    <type>
      <types>CatalogRef.Склады</types>
      <types>DocumentRef.ЗаказПоставщику</types>
      <types>CatalogRef.Подразделения</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </resources>
  <resources>
    <name>ВПути</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипШК</name>
    <type>
      <types>EnumRef.ТипыШтрихКодов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ШтрихКодУпаковки</name>
    <type>
      <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/AccumulationRegisters/ОстаткиДоступныхКМ/ОстаткиДоступныхКМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстаткиДоступныхКМ</name>
  <resources>
    <name>ЭмитированноКМ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДоступноКМ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Местонахождение</name>
    <type>
      <types>CatalogRef.Склады</types>
      <types>DocumentRef.ЗаказПоставщику</types>
      <types>CatalogRef.Подразделения</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипКода</name>
    <type>
      <types>EnumRef.ТипыКодовМаркировки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СпособВводаВОборот</name>
    <type>
      <types>EnumRef.СпособыВводаВОборотСУЗ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Нанесен</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

snlkuharlocal/src/Enums/СтатусыДокументовМаркировки/СтатусыДокументовМаркировки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыДокументовМаркировки</name>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>ОжиданиеОтложеннойОбработки</name>
  </enumValues>
  <enumValues>
    <name>КОбработке</name>
  </enumValues>
  <enumValues>
    <name>Обрабатывается</name>
  </enumValues>
  <enumValues>
    <name>ОшибкаОбработки</name>
  </enumValues>
  <enumValues>
    <name>ОбработанЧЗ</name>
  </enumValues>
  <enumValues>
    <name>ОшибкаОбработкиЧЗ</name>
  </enumValues>
  <enumValues>
    <name>Обработан</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/СпособыВводаВОборотСУЗ/СпособыВводаВОборотСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СпособыВводаВОборотСУЗ</name>
  <enumValues>
    <name>Производство</name>
  </enumValues>
  <enumValues>
    <name>Импорт</name>
  </enumValues>
  <enumValues>
    <name>МаркировкаОстатков</name>
  </enumValues>
  <enumValues>
    <name>ТрансграничнаяТорговля</name>
  </enumValues>
  <enumValues>
    <name>Перемаркировка</name>
  </enumValues>
  <enumValues>
    <name>Комиссия</name>
  </enumValues>
  <enumValues>
    <name>ПокупкаВРФ</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/ВидыКомплектов/ВидыКомплектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыКомплектов</name>
  <enumValues>
    <name>Комплект</name>
  </enumValues>
  <enumValues>
    <name>Ассортито</name>
  </enumValues>
  <enumValues>
    <name>Товар</name>
  </enumValues>
  <enumValues>
    <name>ГотовыйКомплект</name>
  </enumValues>
  <enumValues>
    <name>АссортитоКомплектов</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/ВидыНоменклатурыЧЗ/ВидыНоменклатурыЧЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыНоменклатурыЧЗ</name>
  <enumValues>
    <name>Единица</name>
  </enumValues>
  <enumValues>
    <name>Комплект</name>
  </enumValues>
  <enumValues>
    <name>Набор</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/ТипУзлаИБ/ТипУзлаИБ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипУзлаИБ</name>
  <enumValues>
    <name>ИнтегральнаяИБ</name>
  </enumValues>
  <enumValues>
    <name>УправляющееПодразделение</name>
  </enumValues>
  <enumValues>
    <name>Склад</name>
  </enumValues>
  <enumValues>
    <name>ТорговоеПодразделение</name>
  </enumValues>
  <enumValues>
    <name>Филиал</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/СтатусыКодовМаркировкиИСМП/СтатусыКодовМаркировкиИСМП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыКодовМаркировкиИСМП</name>
  <enumValues>
    <name>Эмитирован</name>
    <comment>EMITTED</comment>
  </enumValues>
  <enumValues>
    <name>Нанесен</name>
    <comment>APPLIED</comment>
  </enumValues>
  <enumValues>
    <name>ВведенВОборот</name>
    <comment>INTRODUCED</comment>
  </enumValues>
  <enumValues>
    <name>ВведенВОборотПриВозврате</name>
  </enumValues>
  <enumValues>
    <name>ВыведенИзОборота_РозничнаяПродажа</name>
    <comment>RETIRED</comment>
  </enumValues>
  <enumValues>
    <name>ВыведенИзОборота_ЭкспортВСтраныЕАЭС</name>
    <comment>RETIRED</comment>
  </enumValues>
  <enumValues>
    <name>ВыведенИзОборота_ЭкспортЗаПределыСтранЕАЭС</name>
    <comment>RETIRED</comment>
  </enumValues>
  <enumValues>
    <name>ВыведенИзОборота_ВозвратФЛ</name>
    <comment>RETIRED</comment>
  </enumValues>
  <enumValues>
    <name>ВыведенИзОборота_УтратаИлиПовреждении</name>
    <comment>RETIRED</comment>
  </enumValues>
  <enumValues>
    <name>ВыведенИзОборота_Уничтожен</name>
    <comment>RETIRED</comment>
  </enumValues>
  <enumValues>
    <name>ВыведенИзОборота_Конфискация</name>
    <comment>RETIRED</comment>
  </enumValues>
  <enumValues>
    <name>ВыведенИзОборота_ИспользованиеДляСобственныхНужд</name>
    <comment>RETIRED</comment>
  </enumValues>
  <enumValues>
    <name>ВыведенИзОборота_ПоДоговоруРассрочки</name>
    <comment>RETIRED</comment>
  </enumValues>
  <enumValues>
    <name>ВыведенИзОборота_Перемаркировка</name>
    <comment>RETIRED</comment>
  </enumValues>
  <enumValues>
    <name>ВыведенИзОборота_Списание</name>
    <comment>RETIRED</comment>
  </enumValues>
  <enumValues>
    <name>ВыведенИзОборота_БезвозмезднаяПередача</name>
    <comment>RETIRED</comment>
  </enumValues>
  <enumValues>
    <name>ВыведенИзОборота_ПриобретениеГосПредприятием</name>
    <comment>RETIRED</comment>
  </enumValues>
  <enumValues>
    <name>ВыведенИзОборота_ДистанционнаяПродажа</name>
    <comment>RETIRED</comment>
  </enumValues>
  <enumValues>
    <name>Расформирован</name>
    <comment>DISAGGREGATION</comment>
  </enumValues>
  <enumValues>
    <name>ОжидаетДоставки</name>
  </enumValues>
  <enumValues>
    <name>ОжидаетПовторнойМаркировки</name>
  </enumValues>
  <enumValues>
    <name>ОжидаетПередачуСобственнику</name>
  </enumValues>
  <enumValues>
    <name>ОтрицательноеРешениеФТС</name>
  </enumValues>
  <enumValues>
    <name>ОжидаетПодтверждениеФТС</name>
  </enumValues>
  <enumValues>
    <name>НаКонтролеФТС</name>
  </enumValues>
  <enumValues>
    <name>Списан</name>
    <comment>WRITTEN_OFF</comment>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Documents/ЗаказНаЭмиссиюКодовМаркировкиСУЗ/ObjectModule.bsl
#Область ОписаниеПеременных
//++Данилова Е.В. 20.05.2026 MARK-3615 
Перем ЕстьИзменения;  
//--Данилова Е.В. 20.05.2026 
#КонецОбласти

#Область СобытияОбъекта  
Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	Если ЗначениеЗаполнено(Организация) Тогда
		//++Данилова Е.В. 23.06.2026 Проб.№0000000129
		//Префикс = СокрЛП(Организация.Префикс)+"-";
		Префикс = СокрЛП(Организация.Префикс); 
		//--Данилова Е.В. 23.06.2026
	КонецЕсли;
	//++Данилова Е.В. 23.06.2026 Проб.№Проб.№0000000129
	Префикс = Префикс+Маркировка_ПИ.ЭтотУзел_Код("Основной")+"-";
	//--Данилова Е.В. 23.06.2026 
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)	
	ЗаполнитьШапкуДокумента(ЭтотОбъект, ПараметрыСеанса.Пользователь, ОбщегоНазначения_ПИ.ВалютаНац(), "Продажа");
	
	Статус		= Перечисления.СтатусыДокументовМаркировки.ВРаботе;	
	
	//Валетов + 21,02,2026 https://yougile.collant.ru/team/ab6bad3a05c0/#MARK-3522
	//СпособВводаВОборот 		= Перечисления.СпособыВводаВОборотСУЗ.МаркировкаОстатков;
	СпособВводаВОборот 		= Перечисления.СпособыВводаВОборотСУЗ.Перемаркировка;
	//Валетов -
	 
	ДокументОснование   	= ДанныеЗаполнения;
	ПодразделениеНанесения	= Справочники.Подразделения.ПустаяСсылка();
	
	ТипОснования = ТипЗнч(ДанныеЗаполнения);	
	Если ТипОснования = Тип("ДокументСсылка.КонтрактСПроизводителем") Тогда
		СпособВводаВОборот 	= Перечисления.СпособыВводаВОборотСУЗ.Импорт;
		
		Организация 		= ДанныеЗаполнения.Организация;		
		ЗаполнитьТоварыПо_Накладной(ДокументОснование);
	ИначеЕсли ТипОснования = Тип("ДокументСсылка.ЗаказПоставщику") Тогда		
		СпособВводаВОборот 	= Перечисления.СпособыВводаВОборотСУЗ.Импорт;
		
		Организация 		= ДанныеЗаполнения.Организация;		
		ЗаполнитьТоварыПо_Накладной(ДокументОснование);					
	ИначеЕсли ТипОснования = Тип("ДокументСсылка.ПриходнаяНакладная") Тогда		
		СпособВводаВОборот 	= Перечисления.СпособыВводаВОборотСУЗ.Перемаркировка;
		
		Организация 		= ДанныеЗаполнения.Организация;		
		ЗаполнитьТоварыПо_Накладной(ДокументОснование);
	ИначеЕсли ТипОснования = Тип("ДокументСсылка.РасходнаяНакладная") Тогда		
		Организация 		= ДанныеЗаполнения.Организация;
		ЗаполнитьТоварыПо_Накладной(ДокументОснование);							
	ИначеЕсли ТипОснования = Тип("СправочникСсылка.Организации") Тогда
		Организация 		= ДанныеЗаполнения;
		//++Данилова Е.В. 03.04.2025
	ИначеЕсли ТипОснования = Тип("ДокументСсылка.ЗаказНаЭмиссиюКодовМаркировкиСУЗ") Тогда
		ПодразделениеНанесения 	= ДанныеЗаполнения.ПодразделениеНанесения;
		Организация 			= ДанныеЗаполнения.Организация;
		СпособВводаВОборот = ДанныеЗаполнения.СпособВводаВОборот; 
		//--Данилова Е.В. 03.04.2025
	КонецЕсли; 
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка Тогда Возврат КонецЕсли;
	
	Если НЕ Ссылка.Пустая() Тогда
		ДополнительныеСвойства.Вставить("БылСтатус", ПолучитьРеквизитШапки(Ссылка, "Статус"));			
	КонецЕсли;
	
	Если Модифицированность() Тогда
		ГруппыТоваров		= ГруппыТоваровДокумента(ЭтотОбъект);
		КоличествоДокумента = Товары.Итог("Количество");
		
		ВидКомплекта 				= Документы.ЗаказНаЭмиссиюКодовМаркировкиСУЗ.ОпределитьВидКомплекта(Товары.ВыгрузитьКолонку("Номенклатура"));
		//ВидНоменклатурыЧЗВДокументе = Документы.ЗаказНаЭмиссиюКодовМаркировкиСУЗ.ОпределитьВидНоменклатурыЧЗ(ВидКомплекта);		
		//++Данилова Е.В. 04.06.2025 MARK-2355          
		//Если ВидКомплекта = Перечисления.ВидыКомплектов.Комплект Тогда
		//	СпособВводаВОборот = Перечисления.СпособыВводаВОборотСУЗ.Производство;		
		//КонецЕсли;
		ПараметрыДок = Новый Структура("СпособВводаВОборот,ВидКомплекта,Организация,ДокументОснование",СпособВводаВОборот,ВидКомплекта,Организация,ДокументОснование); 
		СпособВводаВОборот =Документы.ЗаказНаЭмиссиюКодовМаркировкиСУЗ.СпособВводаВОборотДляСпайкиПоВидуКомплекта(ПараметрыДок); 	
		
		
		//--Данилова Е.В. 04.06.2025
		//++Данилова Е.В. 03.04.2025
		Если ВидКомплекта = Перечисления.ВидыКомплектов.ГотовыйКомплект
			ИЛИ Документы.ЗаказНаЭмиссиюКодовМаркировкиСУЗ.КомплектСпайка_Импорт(ссылка)
			//++ 29.05.2026 MARK-3615
 			ИЛИ Документы.ЗаказНаЭмиссиюКодовМаркировкиСУЗ.КомплектСпайка_ПоПеремаркировке(ссылка)
 			//--Данилова Е.В. 29.05.2026 
			ИЛИ (ЭтоНовый()
			И ВидКомплекта = Перечисления.ВидыКомплектов.Комплект 
			И СпособВводаВОборот = Перечисления.СпособыВводаВОборотСУЗ.Импорт) Тогда //MARK-2355
			ПересчитатьКоличествоКомплектующихВТоварах(); 
			КоличествоКомплект = Товары.Итог("КоличествоКомплект");
		КонецЕсли;
		//--Данилова Е.В. 03.04.2025
	КонецЕсли; 
	
	//+++Чирков 2025.03.22
	рПроверкиВК = ПроверитьВидыКомплектовВДокументе();
	Если рПроверкиВК.Успешно Тогда
		Если рПроверкиВК.Данные = Перечисления.ВидыКомплектов.Товар Тогда
			ВидНоменклатурыЧЗВДокументе = Перечисления.ВидыНоменклатурыЧЗ.Единица;
		Иначе
			ВидНоменклатурыЧЗВДокументе = Перечисления.ВидыНоменклатурыЧЗ.Набор;				
		КонецЕсли; 
	Иначе
		Отказ = Истина;		
	КонецЕсли;
	
	//++Данилова Е.В. 20.05.2026 MARK-3615 
	ЕстьИзменения = Модифицированность();   
	//--Данилова Е.В. 20.05.2026
	
	//++Данилова Е.В. 24.01.2025 MARK-1288
	//Если Статус = Перечисления.СтатусыДокументовМаркировки.ВРаботе Тогда 
	//	СтруктураДанныхПоТоварам = ПроверитьГотовыеКомплектыВДокументе(Товары.Выгрузить()); 
	//	Если СтруктураДанныхПоТоварам.ГотовыеКомплекты  
	//		И СтруктураДанныхПоТоварам.НеГотовыеКомплекты Тогда   		
	//		
	//		Отказ = Истина; 
	//		
	//		Сообщить("Необходимо выделить готовые наборы в отдельный документ"); 
	//		
	//	ИначеЕсли СтруктураДанныхПоТоварам.ГотовыеКомплекты  
	//		И НЕ СтруктураДанныхПоТоварам.НеГотовыеКомплекты 
	//		И ВидНоменклатурыЧЗВДокументе <> перечисления.ВидыНоменклатурыЧЗ.Набор Тогда 
	//		
	//		ВидНоменклатурыЧЗВДокументе = Перечисления.ВидыНоменклатурыЧЗ.Набор; 
	//		
	//	ИначеЕсли 	СтруктураДанныхПоТоварам.НеГотовыеКомплекты Тогда 
	//		
	//		ВидНоменклатурыЧЗВДокументе = Перечисления.ВидыНоменклатурыЧЗ.ПустаяСсылка(); 
	//		
	//	КонецЕсли;
	//КонецЕсли;
	//--Данилова Е.В. 19.02.2025
	//+++Чирков 2025.03.22
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	Статус				= Перечисления.СтатусыДокументовМаркировки.ВРаботе;
	Автор 				= ПараметрыСеанса.Пользователь;
	ДокументОснование   = Неопределено;
	ИД_ДокументаЧЗ 		= Неопределено;
	ТекстОшибки			= "";
	Закрыт				= Ложь;
	
	ПолученоКодов		= 0;
	ПолученоКодовИзЧЗ	= 0;
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Если СпособВводаВОборот = Перечисления.СпособыВводаВОборотСУЗ.Импорт Тогда
		ПроверяемыеРеквизиты.Добавить("ДокументОснование");	
		МаркировкаКС.УдалитьЭлементМассива(ПроверяемыеРеквизиты, "ПодразделениеНанесения");		
	КонецЕсли; 
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	//++Данилова Е.В. 26.06.2026 Изм.№0000000222
    //возвращаем обратно 
      
//	//++Данилова Е.В. 20.05.2026 MARK-3615 
//	//Если Маркировка_ПИ.ТипТекущегоУзла("ДанныеЧЗ") <> Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда
//	Если Маркировка_ПИ.ТипТекущегоУзла("ДанныеЧЗ") <> Перечисления.ТипУзлаИБ.УправляющееПодразделение
//		И НЕ (Маркировка_ПИ.ТипТекущегоУзла("ДанныеЧЗ") = Перечисления.ТипУзлаИБ.Склад
//		И Документы.Перемаркировка.ОтработкаПоПеремаркировке(ссылка)<> неопределено) Тогда
//		//--Данилова Е.В. 20.05.2026 
//		Отказ = Истина;
//		Возврат; 
//	КонецЕсли;
//	
	Если Маркировка_ПИ.ТипТекущегоУзла("ДанныеЧЗ") <> Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	//--Данилова Е.В. 26.06.2026 
	//++Ратманов управляемые блокировки
	Если НЕ ПроведениеС.БлокировкаПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	Если НЕ ПроведениеС.КонтрольПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	//--Ратманов управляемые блокировки
	
	Запрос = Новый Запрос;
	Запрос.Текст = " 
	|ВЫБРАТЬ
	|	Ссылка КАК ШтрихкодУпаковки,
	|	Ссылка.Владелец.Родитель.ВидКомплекта КАК ВидКомплекта,
	|	ТипКода
	|ИЗ
	|	Справочник.ШтрихкодыУпаковокТоваров
	|ГДЕ
	|	ЗаказКМ = &Ссылка
	|УПОРЯДОЧИТЬ ПО
	|	Владелец.Наименование
	|";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Выборка		= Запрос.Выполнить().Выбрать();
	
	СтатусКМ_ЧЗ			= Перечисления.СтатусыКодовМаркировкиИСМП.Эмитирован;		
	СтатусКМ_Факт		= Перечисления.СтатусыКодовМаркировкиФакт.Эмитирован;		
	
	Пока Выборка.Следующий() Цикл		
		Движение = Движения.СтатусыКМ_ЧЗ.Добавить();
		
		Движение.Период 			= Дата;
		Движение.ШтрихКодУпаковки	= Выборка.ШтрихкодУпаковки;				
		Движение.Статус				= СтатусКМ_ЧЗ;
		
		Если Выборка.ТипКода = Перечисления.ТипыКодовМаркировки.Набор   
			И Выборка.ВидКомплекта <> Перечисления.ВидыКомплектов.ГотовыйКомплект 
			//Валетов + https://yougile.collant.ru/team/ab6bad3a05c0/#MARK-3032
			И  НЕ (Выборка.ВидКомплекта = Перечисления.ВидыКомплектов.Комплект И СпособВводаВОборот = Перечисления.СпособыВводаВОборотСУЗ.Импорт) Тогда
			//Валетов -
			Движение = Движения.СтатусыКМ_Факт.Добавить();
		
			Движение.Период				= Дата + 1;
			Движение.ШтрихКодУпаковки	= Выборка.ШтрихкодУпаковки;
			Движение.Статус				= Перечисления.СтатусыКодовМаркировкиФакт.ГотовКПечати;		
			Движение.Местонахождение	= ПодразделениеНанесения;
		КонецЕсли; 
	КонецЦикла;
	
	Если Движения.СтатусыКМ_Факт.Количество() = 0  Тогда
		Движения.СтатусыКМ_Факт.Очистить();	
	КонецЕсли;   
	СформироватьДвижения_ОстаткиКМ();	   
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка	Тогда
		Возврат 
	КонецЕсли;
	
	//++Данилова Е.В. 24.01.2025 MARK-1288	
	Если Отказ Тогда
	
		Возврат; 	
	
	КонецЕсли;
	
	УстановитьПолучателей();	
	
	//++Данилова Е.В. 25.03.2025
	ИзменениеСтатусаВВО = Ложь; 
	Если ДополнительныеСвойства.Свойство("ИзменениеСтатусаВВО",ИзменениеСтатусаВВО)
		И ИзменениеСтатусаВВО Тогда
		
		
		Возврат; 
		
	КонецЕсли;
	//--Данилова Е.В. 25.03.2025
	//++Данилова Е.В. 26.03.2025 измненено на вид комплекта
	//Если ВидКомплекта = перечисления.ВидыКомплектов.ГотовыйКомплект 
	////--Данилова Е.В. 26.03.2025
	//	И Проведен
	//	И Статус = Перечисления.СтатусыДокументовМаркировки.Обработан Тогда
	//	
	//	//Чирков 2025.02.28 +++ Не надо бесконечно генерить документы при каждом перепроведении !!!
	//	//++Данилова Е.В. 10.03.2025
	//	//ФормированиеНабора = НайтиФормированиеНабора();
	//	//Если ЗначениеЗаполнено(ФормированиеНабора) Тогда Возврат КонецЕсли;
	//	НеПерепроводить = НайтиПодчиненныеДокументы(); 
	//	Если НеПерепроводить Тогда Возврат КонецЕсли;
	//	//Чирков 2025.02.28 ---			
	//	
	//	ДокМаркировкиФормированиеНабора = неопределено;
	//	ДокМаркировкиВводВОборот		= неопределено;
	//	ДокАграгацииГотовыеКомплекты	= неопределено; 
	//	
	//	СоздатьДокументМаркировкаПоЗКГотовыйКомплект(ДокМаркировкиФормированиеНабора);
	//	
	//	ШтрихкодыУпаковокТЧ = ДокМаркировкиФормированиеНабора.ШтрихкодыУпаковок.Выгрузить(); 
	//	
	//	СоздатьДокументВводаВОборотКомплектующих(ДокМаркировкиВводВОборот,ШтрихкодыУпаковокТЧ);
	//	//++Данилова Е.В. 19.02.2025 MARK-1454 Это не нужно
	//	//Если СпособВводаВОборот = Перечисления.СпособыВводаВОборотСУЗ.Импорт Тогда
		//
		//	СоздатьДокументАгрегацииПоГотовымНаборам(ДокАграгацииГотовыеКомплекты,ШтрихкодыУпаковокТЧ); 	
		//
		//КонецЕсли;
		//--Данилова Е.В. 19.02.2025
		
	//	Если ДокМаркировкиВводВОборот <> неопределено Тогда
	//		
	//		//++Данилова Е.В. 25.03.2025
	//		ЗаписанныйДокВводВОборот = НайтиДокумент("МаркировкаТоваровИСМП", Новый Структура("ДокументОснование,ВидОперации,ПометкаУдаления", Ссылка, Перечисления.ВидыОперацийМаркировки.ВводВОборот,ЛОЖЬ)); 
	//		Если НЕ ЗначениеЗаполнено(ЗаписанныйДокВводВОборот)
	//			ИЛИ ЗаписанныйДокВводВОборот.ссылка  =  ДокМаркировкиВводВОборот.ссылка Тогда
	//			
	//			ДокМаркировкиВводВОборот.Записать(РежимЗаписиДокумента.Проведение);	
	//			
	//			Сообщить("Оформлен/изменен документ ввода в оборот комплектующих: " + ДокМаркировкиВводВОборот);	
	//			
	//		КонецЕсли;
	//		
	//		//--Данилова Е.В. 25.03.2025
	//	КонецЕсли; 	
	//	
	//	
	//	Если ДокМаркировкиФормированиеНабора <> Неопределено Тогда
	//		//++Данилова Е.В. 25.03.2025
	//		ЗаписанныйДокФормированиеНабора = НайтиДокумент("МаркировкаТоваровИСМП", Новый Структура("ДокументОснование,ВидОперации,ПометкаУдаления", Ссылка, Перечисления.ВидыОперацийМаркировки.ФормированиеНабора,ЛОЖЬ)); 
	//		Если НЕ ЗначениеЗаполнено(ЗаписанныйДокФормированиеНабора)
	//			ИЛИ ЗаписанныйДокВводВОборот.ссылка  =  ДокМаркировкиФормированиеНабора.ссылка Тогда
	//			
	//			ДокМаркировкиФормированиеНабора.Записать(РежимЗаписиДокумента.Проведение); 
	//			
	//			Сообщить("Оформлен/изменен документ формирования набора: " + ДокМаркировкиФормированиеНабора);
	//		КонецЕсли;
	//		//--Данилова Е.В. 25.03.2025
	//	КонецЕсли;  			
	//	//++Данилова Е.В. 19.02.2025 MARK-1454   Это не нужно 
	//	//Если ДокАграгацииГотовыеКомплекты <> неопределено Тогда
	//	//	
	//	//	ДокАграгацииГотовыеКомплекты.Записать();	
	//	//	
	//	//	Сообщить("Оформлен/изменен документ агрегации по готовым комплектам: " + ДокАграгацииГотовыеКомплекты);
	//	//	
	//	//	
	//	//КонецЕсли;
	//	//--Данилова Е.В. 19.02.2025
	//КонецЕсли;
	//--Данилова Е.В. 24.01.2025
	//++Данилова Е.В. 20.05.2026 MARK-3615 
	 //++Данилова Е.В. 13.03.2026 MARK-3512 
	 //Если Модифицированность() Тогда
	 Если ЕстьИзменения Тогда 
		 //--Данилова Е.В. 20.05.2026 	 
		 Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ЗаказПоставщику") 
			 ИЛИ ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.КонтрактСПроизводителем") Тогда
			 
			 ОбменДаннымиПоAPI_ТСД.ЗаписатьВФонеДатуИзмененияЗаказовДляТСД(ДокументОснование); 	 
			 
		 КонецЕсли;	
		 //++Данилова Е.В. 20.05.2026 MARK-3615
//		 Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.Перемаркировка")
//			 И Проведен   			 
//			 И ОбработанВпервые()   Тогда 
//			 ///////////////////И ЕСЛИ ЭТО ПОСЛЕДНИЙ ДОКУМЕНТ!!!  
//			 ИдентификаторФЗ = Новый УникальныйИдентификатор;
//			 МаркировкаС.ИзменитьСтатусПеремаркировкиВФоне(ссылка, ИдентификаторФЗ);  
//			 
//		 КонецЕсли;
		 //--Данилова Е.В. 20.05.2026
	 КонецЕсли;
	 //--Данилова Е.В. 13.03.2026 
КонецПроцедуры


Процедура ОбработкаУдаленияПроведения(Отказ)
	//++Ратманов управляемые блокировки
	Если НЕ ПроведениеС.БлокировкаПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	Если НЕ ПроведениеС.КонтрольПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	//--Ратманов управляемые блокировки
	//++Данилова Е.В. 26.06.2026 Изм.№0000000222
    //возвращаем обратно 
    //  
//	//++Данилова Е.В. 26.05.2026 MARK-3615 
//	//Если Маркировка_ПИ.ТипТекущегоУзла("ДанныеЧЗ") <> Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда
//	Если Маркировка_ПИ.ТипТекущегоУзла("ДанныеЧЗ") <> Перечисления.ТипУзлаИБ.УправляющееПодразделение
//		И НЕ (Маркировка_ПИ.ТипТекущегоУзла("ДанныеЧЗ") = Перечисления.ТипУзлаИБ.Склад
//		И Документы.Перемаркировка.ОтработкаПоПеремаркировке(ссылка)<> неопределено) Тогда
//		//--Данилова Е.В. 26.05.2026 
//		Отказ = Истина;
//		Возврат; 
//	КонецЕсли;
//	 
	Если Маркировка_ПИ.ТипТекущегоУзла("ДанныеЧЗ") <> Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	//--Данилова Е.В. 26.06.2026 
КонецПроцедуры

#КонецОбласти

Функция СформироватьДвижения_ОстаткиКМ()
	ПодразделениеОдн= Справочники.Подразделения.НайтиПоКоду("SSP-0211");
	
	Запрос			= Новый Запрос;
	Запрос.Текст	= "
	|ВЫБРАТЬ
	|	Номенклатура.Родитель.ВидКомплекта 	КАК ВидКомплекта,
	|	Номенклатура						КАК Номенклатура,
	|	Ссылка.Дата 						КАК Период,
	|	Ссылка.ПодразделениеНанесения 		КАК Местонахождение,
	|	Ссылка.СпособВводаВОборот 			КАК СпособВводаВОборот,
	|	Количество							КАК ЭмитированноКМ
	|ИЗ
	|	Документ.ЗаказНаЭмиссиюКодовМаркировкиСУЗ.Товары КАК ЗаказНаЭмиссиюКодовМаркировкиСУЗТовары
	|ГДЕ
	|	Ссылка = &Ссылка
	|";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл	
		Запись = Движения.ОстаткиДоступныхКМ.Добавить();
		ЗаполнитьЗначенияСвойств(Запись, Выборка);
		Если Выборка.ВидКомплекта = Перечисления.ВидыКомплектов.Товар Тогда
			Запись.ТипКода = Перечисления.ТипыКодовМаркировки.Товар;
		Иначе                                                       
			Запись.ТипКода = Перечисления.ТипыКодовМаркировки.Набор;			
		КонецЕсли;		
		
		Если НЕ ЗначениеЗаполнено(Запись.Местонахождение) Тогда
			Запись.Местонахождение = ПодразделениеОдн;		
		КонецЕсли;		
	КонецЦикла;
КонецФункции //СформироватьДвижения_ОстаткиКМ()

Функция ЗаполнитьТоварыПо_Накладной(Док_Ссылка)
	Товары.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	Номенклатура,
	|	Номенклатура.ГТИН   КАК ГТИН,
	|	СУММА(Заявка)		КАК Количество	
	|ИЗ
	|	"+Док_Ссылка.Метаданные().ПолноеИмя()+".Товары
	|ГДЕ
	|	Ссылка = &Док_Ссылка
	|	И НЕ Номенклатура.СтатусКарточкиВЧЗ В (
	|		ЗНАЧЕНИЕ(Перечисление.СтатусыКарточкиНоменклатурыВЧЗ.ПустаяСсылка),
	|		ЗНАЧЕНИЕ(Перечисление.СтатусыКарточкиНоменклатурыВЧЗ.НеПодлежитМаркировке)
	|	)
	|СГРУППИРОВАТЬ ПО
	|	Номенклатура
	|УПОРЯДОЧИТЬ ПО
	|	Номенклатура.Наименование
	|";
	
	Запрос.УстановитьПараметр("Док_Ссылка", Док_Ссылка);	
	
	Товары.Очистить();
	Товары.Загрузить(Запрос.Выполнить().Выгрузить());
	
	Для Каждого СтрокаТ Из Товары Цикл
		Если НЕ ЗначениеЗаполнено(СтрокаТ.ГТИН) Тогда
			СтрокаТ.ГТИН = Справочники.Номенклатура.ПолучитьГТИН(СтрокаТ.Номенклатура);		
		КонецЕсли;
	КонецЦикла; 
КонецФункции // ()

Функция ПроверитьВидыКомплектовВДокументе()
	Результат = МаркировкаКС.СтруктураРезультата();

	Запрос = Новый Запрос;
	Запрос.Текст = " 
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Родитель.ВидКомплекта КАК ВидКомплекта,
	|	Ссылка КАК Номенклатура,
	|	Код    КАК Номенклатура_Код
	|ИЗ
	|	Справочник.Номенклатура 
	|ГДЕ
	|	Ссылка В (&МассивНоменклатуры)
	|ИТОГИ ПО
	|	ВидКомплекта	
	|";
	
	Запрос.УстановитьПараметр("МассивНоменклатуры", Товары.ВыгрузитьКолонку("Номенклатура"));
	
	ВидовКомплектов = 0;
	
	Выборка_ВидКомплекта = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "ВидКомплекта");
	Пока Выборка_ВидКомплекта.Следующий() Цикл
		ВидовКомплектов = ВидовКомплектов + 1;
		Если ЗначениеЗаполнено(Выборка_ВидКомплекта.ВидКомплекта) Тогда
			Результат.Данные = Выборка_ВидКомплекта.ВидКомплекта; 
		Иначе
			Выборка = Выборка_ВидКомплекта.Выбрать();
			Пока Выборка.Следующий() Цикл			
				ТекстОшибки = СтрШаблон("Не указан вид комплекта для номенклатуры: %1 (%2) !", Выборка.Номенклатура, Выборка.Номенклатура_Код);
				Результат.Ошибки.Добавить(ТекстОшибки);			
			КонецЦикла;
		КонецЕсли;	
	КонецЦикла; 
	
	Если ВидовКомплектов > 1 Тогда
		Результат.Ошибки.Добавить("В документе указана номенклатура с различными видами комплекта !");
	КонецЕсли; 
	
	Результат.Успешно = (Результат.Ошибки.Количество() = 0);
	
	Возврат Результат;
КонецФункции // ПроверитьВидыКомплектовВДокументе()

Функция УстановитьПолучателей()	
	
	Если ОбработанВпервые() Тогда 
		//++Данилова Е.В. 26.06.2026 Изм.№0000000222
//		//++Данилова Е.В. 20.05.2026 MARK-3615 
//		ИЛИ ДокументПоПеремаркировкеНаСкладе() Тогда		 
//		//--Данилова Е.В. 20.05.2026 
	    //--Данилова Е.В. 26.06.2026
		Если СпособВводаВОборот <> Перечисления.СпособыВводаВОборотСУЗ.Импорт Тогда
			УзелПолучатель = ОпределитьПолучателя();
			Если ЗначениеЗаполнено(УзелПолучатель) Тогда
				ОбменДанными.Получатели.Добавить(УзелПолучатель);
				//Валетов + 23,04,2025 ПУСТАЯ ЗАДАЧА 
				//Регистрация КМ к выгрузке для наборов. В ЕКАТ выгружается документ с Видом комплекта Готовый набор без ТЧ Штрихкодов упаковок
				Если ВидКомплекта = Перечисления.ВидыКомплектов.ГотовыйКомплект 
					//Валетов+ 14,07,2025 ПУСТАЯ ЗАДАЧА Добавил Регистрацию Кодов Спаек На Екат, т.к. нет ввода в оборот
					ИЛИ ВидКомплекта = Перечисления.ВидыКомплектов.Комплект Тогда
					ЗарегистрироватьКМГотовыхНаборов(УзелПолучатель);   
				КонецЕсли;  
				//Валетов -
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;	
КонецФункции //УстановитьПолучателей()

Функция ОбработанВпервые()
	Результат = Ложь;
	БылСтатус = МаркировкаКС.ПолучитьЗначениеПараметра(ДополнительныеСвойства, "БылСтатус");
	Если Статус = Перечисления.СтатусыДокументовМаркировки.Обработан И БылСтатус <> Статус Тогда
		Результат = Истина;		
	КонецЕсли;
	Возврат Результат;	
КонецФункции //ОбработанВпервые()

Функция ОпределитьПолучателя()
	ИмяПланаОбмена	= "ДанныеЧЗ";
	Результат		= ПланыОбмена[ИмяПланаОбмена].ПустаяСсылка();
	//++Данилова Е.В. 26.06.2026 Изм.№0000000222

	//	//++Данилова Е.В. 19.05.2026 MARK-3615
	//	Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.Перемаркировка") 
	//	ИЛИ (ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ЗаказНаЭмиссиюКодовМаркировкиСУЗ")
	//	И  ТипЗнч(ДокументОснование.ДокументОснование) = Тип("ДокументСсылка.Перемаркировка")) Тогда
	//		ТипУзла				= Маркировка_ПИ.ТипТекущегоУзла(ИмяПланаОбмена);
	//		МассивУзловОФис = Маркировка_ПИ.ПолучитьМассивУзловПоТипу(Перечисления.ТипУзлаИБ.УправляющееПодразделение,ИмяПланаОбмена); 
	//		Если ТипУзла
	//		= Перечисления.ТипУзлаИБ.Склад 
	//			И Статус = Перечисления.СтатусыДокументовМаркировки.КОбработке
	//			И МассивУзловОФис.Количество() > 0  Тогда
	//			Результат = МассивУзловОФис[0];	 
	//		КонецЕсли;
	//		
	//		Если ТипУзла = Перечисления.ТипУзлаИБ.УправляющееПодразделение И Статус
	//			= Перечисления.СтатусыДокументовМаркировки.Обработан Тогда
	//			Если ЗначениеЗаполнено(ПодразделениеНанесения) И ТипЗнч(ПодразделениеНанесения) = Тип(
	//				"СправочникСсылка.Подразделения") Тогда
	//				УзелПолучатель	= Маркировка_ПИ.УзелПодразделения(ПодразделениеНанесения, ИмяПланаОбмена);
	//				Если ЗначениеЗаполнено(УзелПолучатель) И УзелПолучатель <> Маркировка_ПИ.ЭтотУзел(ИмяПланаОбмена) Тогда
	//					Результат = УзелПолучатель;
	//				КонецЕсли;
	//
	//			КонецЕсли;
	//		КонецЕсли; 
	//	Возврат Результат; 
	//	КонецЕсли;
	//    //--Данилова Е.В. 19.05.2026
    //--Данилова Е.В. 26.06.2026  
    ТипУзла				= Маркировка_ПИ.ТипТекущегоУзла(); 
	Если ЗначениеЗаполнено(ПодразделениеНанесения) И ТипЗнч(ПодразделениеНанесения) = Тип("СправочникСсылка.Подразделения") Тогда		
		УзелПолучатель	= Маркировка_ПИ.УзелПодразделения(ПодразделениеНанесения, ИмяПланаОбмена);		
		Если ЗначениеЗаполнено(УзелПолучатель) И УзелПолучатель <> Маркировка_ПИ.ЭтотУзел(ИмяПланаОбмена) Тогда
			Результат = УзелПолучатель;
		КонецЕсли;	
	КонецЕсли;
	
	Возврат Результат;
КонецФункции //ОпределитьПолучателяКодов()

//++Данилова Е.В. 24.01.2025
// <Описание функции>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
// Возвращаемое значение:
//   <Тип.Вид>   - <описание возвращаемого значения>
//
Функция ПроверитьГотовыеКомплектыВДокументе(ТаблицаТоваров)  Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТоварыТЧ.Номенклатура КАК Номенклатура
		|ПОМЕСТИТЬ ВтТовары
		|ИЗ
		|	&Товары КАК ТоварыТЧ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗаказНаЭмиссиюКодовМаркировкиСУЗТовары.Номенклатура КАК Номенклатура
		|ИЗ
		|	ВтТовары КАК ЗаказНаЭмиссиюКодовМаркировкиСУЗТовары
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК НоменклатураСпр
		|		ПО ЗаказНаЭмиссиюКодовМаркировкиСУЗТовары.Номенклатура = НоменклатураСпр.Ссылка
		|			И (НоменклатураСпр.ВидКомплекта = ЗНАЧЕНИЕ(Перечисление.ВидыКомплектов.ГотовыйКомплект))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗаказНаЭмиссиюКодовМаркировкиСУЗТовары.Номенклатура КАК Номенклатура
		|ИЗ
		|	ВтТовары КАК ЗаказНаЭмиссиюКодовМаркировкиСУЗТовары
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК НоменклатураСпр
		|		ПО ЗаказНаЭмиссиюКодовМаркировкиСУЗТовары.Номенклатура = НоменклатураСпр.Ссылка
		|			И (НоменклатураСпр.ВидКомплекта <> ЗНАЧЕНИЕ(Перечисление.ВидыКомплектов.ГотовыйКомплект))";
	
	Запрос.УстановитьПараметр("Товары",ТаблицаТоваров);
	
	РезультатЗапросаПакеты = Запрос.ВыполнитьПакет();
	
	ГотовыеКомплекты =  НЕ РезультатЗапросаПакеты[1].Пустой();  
	
    НеГотовыеКомплекты = НЕ РезультатЗапросаПакеты[2].Пустой();
	
	Возврат Новый Структура("ГотовыеКомплекты, НеГотовыеКомплекты",ГотовыеКомплекты,НеГотовыеКомплекты); 
	
КонецФункции // ПроверитьГотовыеКомплектыВДокументе()

// <Описание процедуры>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
Функция СоздатьДокументПоТаблицеТоваров(ДокументОснование,ТаблицаТоваров,ВидНоменклатурыЧЗВДокументе)  Экспорт 

	    ЗаказНаЭмиссиюКодовМаркировкиСУЗ = Документы.ЗаказНаЭмиссиюКодовМаркировкиСУЗ.СоздатьДокумент(); 
		
		ЗаполнитьЗначенияСвойств(ЗаказНаЭмиссиюКодовМаркировкиСУЗ,ДокументОснование,,"Дата,Номер,КоличествоДокумента"); 
		
		ЗаказНаЭмиссиюКодовМаркировкиСУЗ.Дата = ТекущаяДатаСеанса(); 
		
		ЗаказНаЭмиссиюКодовМаркировкиСУЗ.Товары.Загрузить(ТаблицаТоваров); 
		
		ЗаказНаЭмиссиюКодовМаркировкиСУЗ.ВидНоменклатурыЧЗВДокументе = ВидНоменклатурыЧЗВДокументе;
		//++Данилова Е.В. 26.03.2025
		ЗаказНаЭмиссиюКодовМаркировкиСУЗ.ВидКомплекта = Перечисления.ВидыКомплектов.ГотовыйКомплект; 
		//--Данилова Е.В. 26.03.2025
		
		ЗаказНаЭмиссиюКодовМаркировкиСУЗ.Записать(); 
		
		Возврат ЗаказНаЭмиссиюКодовМаркировкиСУЗ.Ссылка; 		 
		
КонецФункции // ЗаполнитьДокументПоТаблицеТоваров()

// <Описание функции>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
// Возвращаемое значение:
//   <Тип.Вид>   - <описание возвращаемого значения>
//
Функция СоздатьНовыйДокументПоГотовымКомплектам(ДокОснование,ТаблицаТоваров) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВТТовары.Номенклатура КАК Номенклатура,
	|	ВТТовары.ГТИН КАК ГТИН,
	|	ВТТовары.Количество КАК Количество
	|ПОМЕСТИТЬ ВТТовары
	|ИЗ
	|	&Товары КАК ВТТовары
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаказНаЭмиссиюКодовМаркировкиСУЗТовары.Номенклатура КАК Номенклатура,
	|	ЗаказНаЭмиссиюКодовМаркировкиСУЗТовары.ГТИН КАК ГТИН,
	|	ЗаказНаЭмиссиюКодовМаркировкиСУЗТовары.Количество КАК Количество
	|ИЗ
	|	ВТТовары КАК ЗаказНаЭмиссиюКодовМаркировкиСУЗТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК НоменклатураСпр
	|		ПО ЗаказНаЭмиссиюКодовМаркировкиСУЗТовары.Номенклатура = НоменклатураСпр.Ссылка
	|			И (НоменклатураСпр.ВидКомплекта = ЗНАЧЕНИЕ(Перечисление.ВидыКомплектов.ГотовыйКомплект))";
	
	
	Запрос.УстановитьПараметр("Товары",ТаблицаТоваров);
	
	Возврат СоздатьДокументПоТаблицеТоваров(ДокОснование,Запрос.Выполнить().Выгрузить(),Перечисления.ВидыНоменклатурыЧЗ.Набор); 


КонецФункции // СоздатьНовыйДокументПоГотовымКомплектам()

//++Данилова Е.В. 03.04.2025 ASU-2175
Процедура ПересчитатьКоличествоКомплектующихВТоварах() Экспорт
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Товары",Товары.Выгрузить()); 
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказНаЭмиссиюКодовМаркировкиСУЗТовары.Номенклатура КАК Номенклатура,
		|	ЗаказНаЭмиссиюКодовМаркировкиСУЗТовары.ГТИН КАК ГТИН,
		|	ЗаказНаЭмиссиюКодовМаркировкиСУЗТовары.Количество КАК Количество
		|ПОМЕСТИТЬ ВТТовары
		|ИЗ
		|	&Товары КАК ЗаказНаЭмиссиюКодовМаркировкиСУЗТовары
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТТовары.Номенклатура КАК Номенклатура,
		|	ВТТовары.ГТИН КАК ГТИН,
		|	МАКСИМУМ(ВТТовары.Количество) КАК Количество,
		|	СУММА(НоменклатураКоплектующие.Количество) * МАКСИМУМ(ВТТовары.Количество) КАК КоличествоКомплект
		|ИЗ
		|	ВТТовары КАК ВТТовары
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК НоменклатураСпр
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура.Коплектующие КАК НоменклатураКоплектующие
		|			ПО НоменклатураСпр.Ссылка = НоменклатураКоплектующие.Ссылка
		|				И (НЕ(НоменклатураКоплектующие.Номенклатура.СтатусКарточкиВЧЗ = ЗНАЧЕНИЕ(Перечисление.СтатусыКарточкиНоменклатурыВЧЗ.ПустаяСсылка)
		|						ИЛИ НоменклатураКоплектующие.Номенклатура.СтатусКарточкиВЧЗ = ЗНАЧЕНИЕ(Перечисление.СтатусыКарточкиНоменклатурыВЧЗ.НеПодлежитМаркировке)))
		|		ПО ВТТовары.Номенклатура = НоменклатураСпр.Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТТовары.Номенклатура,
		|	ВТТовары.ГТИН";
	
	Товары.Загрузить(Запрос.Выполнить().Выгрузить()); 	

КонецПроцедуры

//Валетов + 23,04,2025 ПУСТАЯ ЗАДАЧА 
//Регистрация КМ к выгрузке для наборов. В ЕКАТ выгружается документ с Видом комплекта Готовый набор без Марок, по этой Эмиссии
Процедура ЗарегистрироватьКМГотовыхНаборов(УзелПолучателя)

	СписокУзлов=новый Массив;
	СписокУзлов.Добавить(УзелПолучателя);
	
	запрос=новый запрос;
	
	запрос.Текст = "ВЫБРАТЬ
	|	ШтрихкодыУпаковокТоваров.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ШтрихкодыУпаковокТоваров КАК ШтрихкодыУпаковокТоваров
	|ГДЕ
	|	ШтрихкодыУпаковокТоваров.ЗаказКМ = &ДокЭмиссии";
	запрос.УстановитьПараметр("ДокЭмиссии",Ссылка);
	МассивКМ = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
	запрос.Текст="ВЫБРАТЬ различные
	|	СтатусыКМ_ЧЗ.Регистратор КАК Регистратор
	|ИЗ
	|	РегистрСведений.СтатусыКМ_ЧЗ КАК СтатусыКМ_ЧЗ
	|ГДЕ
	|	СтатусыКМ_ЧЗ.ШтрихКодУпаковки В(&ШтрихКодУпаковки)";
	запрос.УстановитьПараметр("ШтрихКодУпаковки",МассивКМ);
	Выборка=запрос.выполнить().выбрать();
	пока Выборка.Следующий() цикл
		НаборЗаписей = РегистрыСведений.СтатусыКМ_ЧЗ.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Регистратор.Установить(Выборка.Регистратор);	
		ПланыОбмена.ЗарегистрироватьИзменения(СписокУзлов, НаборЗаписей);
	КонецЦикла;
	
	запрос.Текст="ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СтатусыКМ_Факт.Регистратор КАК Регистратор
	|ИЗ
	|	РегистрСведений.СтатусыКМ_Факт КАК СтатусыКМ_Факт
	|ГДЕ
	|	СтатусыКМ_Факт.ШтрихКодУпаковки В(&ШтрихКодУпаковки)";
	запрос.УстановитьПараметр("ШтрихКодУпаковки",МассивКМ);
	Выборка=запрос.выполнить().выбрать();
	пока Выборка.Следующий() цикл
		НаборЗаписей = РегистрыСведений.СтатусыКМ_Факт.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Регистратор.Установить(Выборка.Регистратор);	
		ПланыОбмена.ЗарегистрироватьИзменения(СписокУзлов, НаборЗаписей);
	КонецЦикла;
		
	для каждого СтрСписка из МассивКМ цикл	
		ПланыОбмена.ЗарегистрироватьИзменения(СписокУзлов, СтрСписка);		
	КонецЦикла;
КонецПроцедуры

//--Данилова Е.В. 03.04.2025
//++Данилова Е.В. 26.06.2026 Изм.№0000000222
////++Данилова Е.В. 20.05.2026 MARK-3615 
//Функция ДокументПоПеремаркировкеНаСкладе()
//	БылСтатус = МаркировкаКС.ПолучитьЗначениеПараметра(ДополнительныеСвойства, "БылСтатус");
//	Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.Перемаркировка")
//		ИЛИ (ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ЗаказНаЭмиссиюКодовМаркировкиСУЗ")
//		И  ТипЗнч(ДокументОснование.ДокументОснование) = Тип("ДокументСсылка.Перемаркировка"))
//		И Статус = Перечисления.СтатусыДокументовМаркировки.КОбработке 
//		И БылСтатус <> Статус Тогда
//		
//		Возврат истина; 	
//		
//	КонецЕсли;
//	Возврат Ложь; 
//КонецФункции // ()
////--Данилова Е.В. 20.05.2026 
//--Данилова Е.В. 26.06.2026
